Tekla Open API Reference for Tekla Structures 2025
WpfOkCreateCancel.OkClicked Event
 The OkClicked event is raised when the Ok button is clicked.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler OkClicked
Public Event OkClicked As EventHandler
Value
Type: System.EventHandler
See Also
Reference
WpfOkCreateCancel Class
Tekla.Structures.Dialog.UIControls Namespace